viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
      <!-- *************************  Device 'STM32F100RB'  ***************************** -->
      <device Dname="STM32F100RB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents\STM32F100x4_x6_x8_xB_DS.pdf"             title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="7"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
        <feature type="BGA"           n="64"                          name="BGA"/>
      </device>
      
      <!-- *************************  Device 'STM32F100RC'  ***************************** -->
      <device Dname="STM32F100RC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents\STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="3"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F100RD'  ***************************** -->
      <device Dname="STM32F100RD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents\STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="3"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="5"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F100RE'  ***************************** -->
      <device Dname="STM32F100RE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="24000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD_VL"/>
        <debug      svd="SVD\STM32F100xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F100xx_UM.pdf"                      title="STM32F100 Series Reference Manual"/>
        <book    name="Documents\STM32F100xC_xD_xE_DS.pdf"                title="STM32F100 Data Sheet"/>
        <feature type="Timer"         n="11"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="3"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="5"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
