viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
      <!-- *************************  Device 'STM32F101T8'  ***************************** -->
      <device Dname="STM32F101T8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101x8_xB_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="36"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101TB'  ***************************** -->
      <device Dname="STM32F101TB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101x8_xB_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="36"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101V8'  ***************************** -->
      <device Dname="STM32F101V8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101x8_xB_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VB'  ***************************** -->
      <device Dname="STM32F101VB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101x8_xB_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VC'  ***************************** -->
      <device Dname="STM32F101VC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VD'  ***************************** -->
      <device Dname="STM32F101VD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VE'  ***************************** -->
      <device Dname="STM32F101VE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101xC_xD_xE_DS.pdf"                title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="6"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VF'  ***************************** -->
      <device Dname="STM32F101VF">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_XL"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101xF_xG_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F101VG'  ***************************** -->
      <device Dname="STM32F101VG">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="36000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_XL"/>
        <debug      svd="SVD\STM32F101xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x14000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_1024.FLM" start="0x08000000"  size="0x100000"                 default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F101xF_xG_DS.pdf"                   title="STM32F101 Data Sheet"/>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="80"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="QFP"           n="100"                         name="QFP"/>
      </device>
      
