viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
      <!-- *************************  Device 'STM32F102C6'  ***************************** -->
      <device Dname="STM32F102C6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x4_x6_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="ADC"           n="10"      m="16"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102C8'  ***************************** -->
      <device Dname="STM32F102C8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x8_xB_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="16"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102CB'  ***************************** -->
      <device Dname="STM32F102CB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x8_xB_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102R4'  ***************************** -->
      <device Dname="STM32F102R4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x4_x6_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102R6'  ***************************** -->
      <device Dname="STM32F102R6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x4_x6_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="2"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102R8'  ***************************** -->
      <device Dname="STM32F102R8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x8_xB_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F102RB'  ***************************** -->
      <device Dname="STM32F102RB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F102xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F102x8_xB_DS.pdf"                   title="STM32F102 Data Sheet"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="12000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F103'  **************************** -->
      <subFamily DsubFamily="STM32F103">
        <feature type="USBD"          n="1"                           name="USB Device"/>
        <feature type="CAN"           n="1"                           name="CAN"/>
      
      <!-- *************************  Device 'STM32F103C4'  ***************************** -->
      <device Dname="STM32F103C4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_16.FLM"   start="0x08000000"  size="0x4000"                   default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103x4_x6_DS.pdf"                   title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F103C6'  ***************************** -->
      <device Dname="STM32F103C6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_LD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103x4_x6_DS.pdf"                   title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="3"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="1"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="1"                           name="I2C"/>
        <feature type="USART"         n="2"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
      <!-- *************************  Device 'STM32F103C8'  ***************************** -->
      <device Dname="STM32F103C8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_MD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x5000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_128.FLM"  start="0x08000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103x8_xB_DS.pdf"                   title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="4"       m="16"/>
        <feature type="ADC"           n="10"      m="12"/>
        <feature type="IOs"           n="36"                          name="Inputs/Outputs"/>
        <feature type="SPI"           n="2"       m="18000000"        name="SPI"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="QFP"           n="48"                          name="QFP"/>
      </device>
      
