viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
      <!-- *************************  Device 'STM32F103RC'  ***************************** -->
      <device Dname="STM32F103RC">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103xC_xD_xE_DS.pdf"                title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2S"           n="2"                           name="I2S"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="SDIO"          n="1"                           name="SDIO"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
        <feature type="CSP"           n="64"                          name="CSP"/>
      </device>
      
      <!-- *************************  Device 'STM32F103RD'  ***************************** -->
      <device Dname="STM32F103RD">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103xC_xD_xE_DS.pdf"                title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2S"           n="2"                           name="I2S"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="SDIO"          n="1"                           name="SDIO"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
        <feature type="CSP"           n="64"                          name="CSP"/>
      </device>
      
      <!-- *************************  Device 'STM32F103RE'  ***************************** -->
      <device Dname="STM32F103RE">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device\Include\stm32f10x.h"  define="STM32F10X_HD"/>
        <debug      svd="SVD\STM32F103xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash\STM32F10x_512.FLM"  start="0x08000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash\STM32F10x_OPT.FLM"  start="0x1FFFF800"  size="0x0010"                   default="0"/>
        <book    name="Documents\STM32F101xx_2xx_3xx_5xx_7xx_UM.pdf"      title="STM32F101 F103 F105 F107 Series Reference Manual"/>
        <book    name="Documents\STM32F103xC_xD_xE_DS.pdf"                title="STM32F103 Data Sheet"/>
        <book    name="Documents\mcbstm32e.chm"                            title="MCBSTM32E User's Guide"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="ADC"           n="16"      m="16"/>
        <feature type="IOs"           n="51"                          name="Inputs/Outputs"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="3"       m="18000000"        name="SPI"/>
        <feature type="I2S"           n="2"                           name="I2S"/>
        <feature type="I2C"           n="2"                           name="I2C"/>
        <feature type="USART"         n="3"       m="4500000"         name="USART"/>
        <feature type="UART"          n="2"       m="4500000"         name="UART"/>
        <feature type="SDIO"          n="1"                           name="SDIO"/>
        <feature type="QFP"           n="64"                          name="QFP"/>
        <feature type="CSP"           n="64"                          name="CSP"/>
      </device>
      
