viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
    <condition id="STM32F1xx LD">
      <description>STMicroelectronics STM32F1xx Low Density Device</description>
      <accept Dname="STM32F10[123]?[46]"/>
    </condition>

    <condition id="STM32F1xx MD">
      <description>STMicroelectronics STM32F1xx Mid Density Device</description>
      <accept Dname="STM32F10[123]?[8B]"/>
    </condition>

    <condition id="STM32F1xx HD">
      <description>STMicroelectronics STM32F1xx High Density Device</description>
      <accept Dname="STM32F10[123]?[CDE]"/>
    </condition>

    <condition id="STM32F1xx XL">
      <description>STMicroelectronics STM32F1xx XL Density Device</description>
      <accept Dname="STM32F10[123]?[FG]"/>
    </condition>
  
    <condition id="STM32F1xx CL">
      <description>STMicroelectronics STM32F1xx Connectivity Line Device</description>
      <accept Dname="STM32F10[57]??"/>
    </condition>

    <condition id="STM32F1xx HD XL">
      <description>STMicroelectronics STM32F1xx High / XL Density Device</description>
      <accept Dname="STM32F10[13]??"/>
    </condition>

    <condition id="STM32F1xx LD MD HD">
      <description>STMicroelectronics STM32F1xx Low / Med / High Density Line Device</description>
      <accept Dname="STM32F10[0123]??"/>
    </condition>

    <condition id="Device.Driver_SPI.API">
      <description>Depends on the SPI Driver API from Keil MW</description>
      <require Cclass="Device" Cgroup="Driver SPI" Csub="API"/>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
    </condition>

    <condition id="STM32F1xx CMSIS GPIO">
      <description>STMicroelectronics STM32F1 Series GPIO Driver with CMSIS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS GPIO">
      <description>STMicro STM32F1 Series GPIO Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS GPIO DMA">
      <description>STMicro STM32F1 Series GPIO and DMA Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1????"/>
      <require Cclass ="Device" Cgroup="GPIO" />
      <require Cclass ="Device" Cgroup="DMA" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS GPIO SPI">
      <description>STMicroelectronics STM32F1 Series GPIO and SPI Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1????"/>
      <require Cclass ="Drivers" Cgroup="SPI" />
    </condition>

    <condition id="STM32F1xx CMSIS RTOS I2C">
      <description>STMicroelectronics STM32F1 Series I2C Driver with CMSIS and RTOS</description>
      <require Cclass ="CMSIS" Cgroup="CORE"/>
      <require Cclass ="CMSIS" Cgroup="RTOS"/>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F1????"/>
      <require Cclass ="Drivers" Cgroup="I2C" />
    </condition>
  </conditions>

  <examples>
    <!-- MCBSTM32E Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\Blinky">
      <description>Blinky example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\emWin\Example">
      <description>emWin Graphics simple example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\emWin\GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>
    
    <example name="USB Device HID" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\Middleware\USB\Device\HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and Joystick</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\Middleware\USB\Device\MassStorage" version="1.0.0">
      <description>USB Mass Storage Device using SD/MMC Memory Card or RAM as storage media</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32E\Middleware\FileSystem\File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="MCBSTM32E" vendor="Keil"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

