viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
    <example name="BSD Client" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\BSD_Client" version="1.0.0">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\BSD_Server" version="1.0.0">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\FTP_Server" version="1.0.0">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\HTTP_Server" version="1.0.0">
      <description>Compact Web Server with CGI interface</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\SMTP_Client" version="1.0.0">
      <description>Example showing how to compose and send emails</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\SNMP_Agent" version="1.0.0">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="Boards\Keil\MCBSTM32C\Middleware\Network\Telnet_Server" version="1.0.0">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="MCBSTM32C" vendor="Keil"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>
  </examples>
  
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="STM32F1xx CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F1xx device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device\Include\"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" name="Device\Source\ARM\STM32F1xx_OPT.s"           attr="template"  select="Flash Option Bytes Template"/>

        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_ld_vl.s" attr="config"    condition="STM32F1xx VL LD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_md_vl.s" attr="config"    condition="STM32F1xx VL MD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_hd_vl.s" attr="config"    condition="STM32F1xx VL HD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_ld.s"    attr="config"    condition="STM32F1xx LD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_md.s"    attr="config"    condition="STM32F1xx MD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_hd.s"    attr="config"    condition="STM32F1xx HD"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_xl.s"    attr="config"    condition="STM32F1xx XL"/>
        <file category="source" name="Device\Source\ARM\startup_stm32f10x_cl.s"    attr="config"    condition="STM32F1xx CL"/>
        
        <!-- system file -->
        <file category="source" name="Device\Source\system_stm32f10x.c"            attr="config"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver\Config\RTE_Device.h"              attr="config"/>
      </files>
    </component>

    <!-- START: STMicroelectronics Standard Peripherals Drivers -->

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="3.5.1" condition="STM32F1 STDPERIPH">
      <description>Standard Peripherals Drivers Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FRAMEWORK
      </RTE_Components_h>
      <files>
        <file category="doc"     name="Device\StdPeriph_Driver\stm32f10x_stdperiph_lib_um.chm"/>
        <file category="include" name="Device\StdPeriph_Driver\inc\"/>
        <file category="source"  name="Device\StdPeriph_Driver\src\misc.c"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\stm32f10x_conf.h" attr="config" version="3.5.0"/>
        <file category="header" name="Device\StdPeriph_Driver\templates\stm32f10x_it.h"   attr="template" select="Interrupt Service Routines"/>
        <file category="source"  name="Device\StdPeriph_Driver\templates\stm32f10x_it.c"   attr="template" select="Interrupt Service Routines"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Analog-to-digital converter (ADC) driver for STM32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_ADC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_adc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_adc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="BKP" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>Backup registers (BKP) driver for STM32F10x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_BKP
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_bkp.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_bkp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Controller area network (CAN) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CAN
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_can.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CEC" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Consumer electronics control controller (CEC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CEC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_cec.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_cec.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="3.5.0" condition="STM32F1 STDPERIPH ">
      <description>CRC calculation unit (CRC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_CRC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_crc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Digital-to-analog converter (DAC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DAC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_dac.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_dac.c"/>
      </files>
    </component>

