viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>MCU debug component (DBGMCU) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DBGMCU
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_dbgmcu.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_dbgmcu.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>DMA controller (DMA) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_DMA
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_dma.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_dma.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EXTI" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>External interrupt/event controller (EXTI) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_EXTI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_exti.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_exti.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Flash" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>Embedded Flash memory driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_flash.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_flash.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FSMC" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Flexible Static Memory Controller (FSMC) driver for STM32F11x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FSMC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_fsmc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_fsmc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>General-purpose I/O (GPIO) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_GPIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_gpio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_gpio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="I2C" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Inter-integrated circuit (I2C) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_I2C
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_i2c.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_i2c.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="IWDG" Cversion="3.5.0" condition="STM32F1 STDPERIPH ">
      <description>Independent watchdog (IWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_IWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_iwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_iwdg.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Power controller (PWR) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_pwr.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_pwr.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>Reset and clock control (RCC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_rcc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_rcc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="3.5.0" condition="STM32F1 STDPERIPH">
      <description>Real-time clock (RTC) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_rtc.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_rtc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SDIO" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Secure digital (SDIO) interface driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SDIO
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_sdio.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_sdio.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_spi.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Timers (TIM) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_tim.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_tim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_usart.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="3.5.0" condition="STM32F1 STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for STM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device\StdPeriph_Driver\inc\stm32f10x_wwdg.h"/>
        <file category="source" name="Device\StdPeriph_Driver\src\stm32f10x_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics Standard Peripherals Drivers -->


