viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
    <component Cclass="Device" Cgroup="GPIO" Cversion="1.01.0" condition="STM32F1xx CMSIS Device">
      <description>GPIO driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver\GPIO_STM32F10x.h"/>
        <file category="source" name="RTE_Driver\GPIO_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="DMA" Cversion="1.01.0" condition="STM32F1xx CMSIS Device">
      <description>DMA driver used by RTE Drivers for STM32F1 Series</description>
      <files>
        <file category="header" name="RTE_Driver\DMA_STM32F10x.h"/>
        <file category="source" name="RTE_Driver\DMA_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="SPI" Cversion="1.03.0" condition="STM32F1xx CMSIS RTOS GPIO DMA">
      <description>SPI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\SPI_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="UART" Cversion="1.01.0" condition="STM32F1xx CMSIS RTOS GPIO DMA">
      <description>UART Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_UART1               /* Driver UART1 */
        #define RTE_Drivers_UART2               /* Driver UART2 */
        #define RTE_Drivers_UART3               /* Driver UART3 */
        #define RTE_Drivers_UART4               /* Driver UART4 */
        #define RTE_Drivers_UART5               /* Driver UART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\UART_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="I2C" Cversion="1.01.0" condition="STM32F1xx CMSIS RTOS GPIO DMA">
      <description>I2C Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\I2C_STM32F10x.c"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="MCI" Cversion="1.01.0" condition="STM32F1xx CMSIS RTOS GPIO DMA">
      <description>MCI Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\MCI_STM32F10x.c"/>
      </files>
    </component>


    <component Cclass="Drivers" Cgroup="Ethernet MAC" Cversion="1.02.0" condition="STM32F1xx CMSIS RTOS GPIO">
      <description>Ethernet MAC Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\EMAC_STM32F10x.c"                                 condition="STM32F1xx CL"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Device" Csub="OTG Full-speed" Cversion="1.03.0" condition="STM32F1xx CMSIS RTOS GPIO">
      <description>USB Device Full-Speed Driver for STM32F1 Connectivity Line Devices</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_STM32F10x_cl.c"                               condition="STM32F1xx CL"/>
        <file category="source" name="RTE_Driver\USBD_STM32F10x_cl.c"                              condition="STM32F1xx CL"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Device" Csub="Full-speed" Cversion="1.0.0" condition="STM32F1xx CMSIS RTOS GPIO">
      <description>USB Device Full-Speed Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\USBD_STM32F10x.c"                                 condition="STM32F1xx LD MD HD"/>
      </files>
    </component>

    <component Cclass="Drivers" Cgroup="USB Host" Cversion="1.0.0" condition="STM32F1xx CMSIS RTOS GPIO">
      <description>USB Host Full-Speed Driver for STM32F1 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver\OTG_STM32F10x_cl.c"                               condition="STM32F1xx CL"/>
        <file category="source" name="RTE_Driver\USBH_STM32F10x_cl.c"                              condition="STM32F1xx CL"/>
      </files>
    </component>

    <!-- MCBSTM32E Development Board -->
    <bundle Cbundle="MCBSTM32E" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCBSTM32E</description>
      <doc>Documents\mcbstm32e.chm</doc>
      <component Cgroup="MCBSTM32E" Csub="A/D Converter" condition="STM32F1xx CMSIS Device">
        <description>A/D Converter driver for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\ADC.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\ADC.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32E" Csub="Graphic LCD" condition="STM32F1xx CMSIS Device">
        <description>Graphic LCD driver for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\Font_6x8_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\Font_16x24_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\GLCD.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\GLCD_16bitIF_STM32F10x.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32E" Csub="emWin LCD" Cvariant="16-bit IF" condition="STM32F1xx CMSIS Device">
        <description>emWin LCD driver (16-bit Interface) for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\LCD_X_16bitIF_STM32F10x.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32E" Csub="Joystick" condition="STM32F1xx CMSIS GPIO">
        <description>Joystick driver for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\Joystick.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\Joystick.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32E" Csub="Keyboard" condition="STM32F1xx CMSIS GPIO">
        <description>Keyboard driver for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\Keyboard.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\Keyboard.c"/>
        </files>
      </component>
