viys/Configuration/Keil5 MDK/stm32/Keil.STM32F1xx_DFP.1.1.0.pdsc
      <component Cgroup="MCBSTM32E" Csub="LED" condition="STM32F1xx CMSIS GPIO">
        <description>LED driver for Keil MCBSTM32E Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32E\Common\LED.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32E\Common\LED.c"/>
        </files>
      </component>
    </bundle>

    <!-- MCBSTM32C Development Board -->
    <bundle Cbundle="MCBSTM32C" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCBSTM32C</description>
      <doc>Documents\mcbstm32c.chm</doc>
      <component Cgroup="MCBSTM32C" Csub="A/D Converter" condition="STM32F1xx CMSIS Device">
        <description>A/D Converter driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\ADC.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\ADC.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="Graphic LCD" condition="STM32F1xx CMSIS Device">
        <description>Graphic LCD driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\Font_6x8_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\Font_16x24_h.h"/>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\GLCD.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\GLCD_SPI_STM32F10x.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="emWin LCD" Cvariant="SPI IF" condition="STM32F1xx CMSIS RTOS GPIO SPI">
        <description>emWin LCD driver (SPI Interface) for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\LCD_X_SPI_STM32F10x.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="Joystick" condition="STM32F1xx CMSIS GPIO">
        <description>Joystick driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\Joystick.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\Joystick.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="Keyboard" condition="STM32F1xx CMSIS GPIO">
        <description>Keyboard driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\Keyboard.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\Keyboard.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="LED" condition="STM32F1xx CMSIS GPIO">
        <description>LED driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\LED.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\LED.c"/>
        </files>
      </component>
      <component Cgroup="MCBSTM32C" Csub="Touchscreen" condition="STM32F1xx CMSIS RTOS I2C">
        <description>Touchscreen driver for Keil MCBSTM32C Development Board</description>
        <files>
          <file category="header" name="Boards\Keil\MCBSTM32C\Common\Touch.h"/>
          <file category="source" name="Boards\Keil\MCBSTM32C\Common\Touch_STMPE811.c"/>
        </files>
      </component>
    </bundle>

  </components>
</package>
